xmlsamples/PI_Pricing/KR-FI-BIS-KRAP3EMP001B.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xrsi="http://www.westernunion.com/schema/xrsi">
   <soapenv:Header/>
   <soapenv:Body>
      <ns2:esp-fee-inquiry-request xmlns:ns2="http://www.westernunion.com/schema/xrsi">
         <partner>
            <id>WGBSKRAP30T</id>
            <system>
               <id>WGBSKRAP30T</id>
               <name>Shinhan Bank</name>
               <version>9101</version>
               <ip_address>10.1.40.181</ip_address>
               <connector>
                  <id>KRAP3EMP001B</id>
               </connector>
            </system>
         </partner>
         <device>
            <id>BM</id>
            <type>MOBILE</type>
         </device>
         <transaction_type>WMN</transaction_type>
         <payment_details>
            <origination>
               <principal_amount>1000</principal_amount>
               <currency_iso_code>USD</currency_iso_code>
               <country_iso_code>KR</country_iso_code>
            </origination>
            <destination>
               <expected_payout_amount>0</expected_payout_amount>
               <currency_iso_code>VND</currency_iso_code>
               <country_iso_code>VN</country_iso_code>
            </destination>
         </payment_details>
      </ns2:esp-fee-inquiry-request>
   </soapenv:Body>
</soapenv:Envelope>